#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------





//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	
	//-------------------------------САМА ПРОГА-------------------------------------

	cout << "Сколько планет в Солнечной системе? " << endl;
	cout << "1) 5" << endl;
	cout << "2) 9" << endl;
	cout << "3) 12" << endl;

	int a;
	int x = 0;
	cin >> a;


	if (a == 2)
	{
		x++;
	}

	cout << "Какова глубина Мореанской впадины?" << endl;
	cout << "1) 5км" << endl;
	cout << "2) 11км" << endl;
	cout << "3) 14км" << endl;
	cin >> a;

	if (a == 2)
	{
		x++;
	}
 
	cout << "каокй массы достигает синий кит?" << endl;
	cout << "1) 10 тонн" << endl;
	cout << "2) 45 тонн" << endl;
	cout << "3) 30 тонн" << endl;
	cin >> a;

	if (a == 3)
	{
		x++;
	}

	cout << "Сколько времен года?" << endl;
	cout << "1) 4" << endl;
	cout << "2) 3" << endl;
	cout << "3) 6" << endl;
	cin >> a;

	if (a == 1)
	{
		x++;
	}

	cout << "сколько людей проживает в России?" << endl;
	cout << "1) 145 млн" << endl;
	cout << "2) 112 млн" << endl;
	cout << "3) 215 млн" << endl;
	cin >> a;

	if (a == 1)
	{
		x++;
	}


	cout << endl << "Ваша оценка за прохождение теста:  " << x << " баллов!" << endl << endl;

	system("pause");

	return 0;
}
